OpenFOAM-3.0.0/3d-monopole/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    piston
    {
        type            wall;
        inGroups        1(wall);
        nFaces          825;
        startFace       568425;
    }
    baffle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3000;
        startFace       569250;
    }
    open
    {
        type            patch;
        nFaces          6825;
        startFace       572250;
    }
)

// ************************************************************************* //
