OpenFOAM-3.0.0/3d-monopole/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    piston
    {
        type            oscillatingFixedValue;
	amplitude	0.1;
	frequency	100;
        refValue           uniform (0 0 0.1);
    }

    baffle
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    open
    {
        type            zeroGradient;
    }

    "(wedge1|wedge2)"
    {
        type            wedge;
    }
}

// ************************************************************************* //
